In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df=pd.DataFrame(data)

In [3]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
data_list= [
    ['John', 'Anna', 'Peter', 'Linda'],
    [28, 34, 29, 42],
    ['New York', 'Paris', 'Berlin', 'London'],
    [65000, 70000, 62000, 85000]
]
df2=pd.DataFrame(data_list)
coloms=["Name","Age","city","salary"]
df2=pd.DataFrame(data_list,columns=coloms)
df2

       Name    Age    city  salary
0      John   Anna   Peter   Linda
1        28     34      29      42
2  New York  Paris  Berlin  London
3     65000  70000   62000   85000

In [5]:
df2

       Name    Age    city  salary
0      John   Anna   Peter   Linda
1        28     34      29      42
2  New York  Paris  Berlin  London
3     65000  70000   62000   85000

In [6]:
df2

       Name    Age    city  salary
0      John   Anna   Peter   Linda
1        28     34      29      42
2  New York  Paris  Berlin  London
3     65000  70000   62000   85000

In [7]:
df["Age"]

0    28
1    34
2    29
3    42
Name: Age, dtype: int64

In [8]:
df[["Name","Age"]]

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [9]:
df["Designation"]=["Doctor","Engineer","IAS","Police"]

In [10]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000         IAS
3  Linda   42    London   85000      Police

In [11]:
df.drop("Designation",axis=1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selecting Rows

In [12]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000         IAS
3  Linda   42    London   85000      Police

In [13]:
df.loc[[0,1]]

   Name  Age      City  Salary Designation
0  John   28  New York   65000      Doctor
1  Anna   34     Paris   70000    Engineer

In [14]:
df.loc[[0,1]][["Age","Salary"]]

   Age  Salary
0   28   65000
1   34   70000

In [15]:
df.loc[[2,3]][["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

In [16]:
df

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000         IAS
3  Linda   42    London   85000      Police

In [26]:
df[(df["Age"]>30) & (df["City"]=="Paris")]

   Name  Age   City  Salary Designation
1  Anna   34  Paris   70000    Engineer